{
  "backend/main.mo": "Defines actor with user profiles, submissions, check-ins/outs, KPI weights config, access control, and all related types and maps.",
  "backend/migration.mo": "Contains type definitions and structures for migrating old actor state to the new format including KPI config and activity records.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten 1–2 sentence summaries for multiple frontend files used across the project.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, authentication flow, role-gated pages, theme provider, and root application shell.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an unauthorized-access screen with sign-out functionality and styled UI components.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Form for new users to enter their name and submit a profile using a saveProfile mutation, with validation and error handling.",
  "frontend/src/components/auth/RoleGate.tsx": "Wraps content with role-based access control by checking user role and optional director requirement, showing a loader or denial screen.",
  "frontend/src/components/checkins/CheckInPhotoViewer.tsx": "Displays a thumbnail for a check-in photo that opens a modal viewer with the full image and optional timestamp.",
  "frontend/src/components/kpi/DailyActivityWeightsCard.tsx": "Card for viewing and editing KPI activity weight configuration with validation, save handling, and loading states.",
  "frontend/src/components/kpi/KPIScoreBadge.tsx": "Shows a KPI preview with total score, color-coded status, and per-activity breakdown using labels and weights.",
  "frontend/src/components/layout/AppShell.tsx": "Application layout with header, navigation based on user role, and sign‑out handling using Internet Identity.",
  "frontend/src/components/monitoring/KPITable.tsx": "Renders a KPI table for submissions with per‑activity scores, totals, loading state, and name resolution from profiles.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, auto-refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, and logout states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, roles, submissions, check-ins, and check-outs.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, color variables, and dark-mode theming for the app.",
  "frontend/src/lib/kpi.ts": "Implements KPI activity definitions and utilities to compute KPI previews, points, and labels based on configurable weights.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity sign‑in and introductory feature descriptions.",
  "frontend/src/pages/MonitoringDashboardPage.tsx": "Displays admin monitoring tools including submissions, profiles, check-ins, KPI stats, and filtering controls.",
  "frontend/src/pages/PrincipalCheckInPage.tsx": "Page for submitting check-ins with required photo upload, validation, compression, and viewing recent check-in history.",
  "frontend/src/pages/PrincipalCheckOutPage.tsx": "Page for submitting check-outs with optional notes and displaying recent check-out history.",
  "frontend/src/pages/PrincipalDailyFormPage.tsx": "Daily activity submission form that tracks five activities, computes KPI previews, and sends structured reports.",
  "frontend/src/pages/UserSettingsPage.tsx": "Admin page to view users, update their roles, and delete accounts with confirmation dialogs.",
  "frontend/src/utils/images.ts": "Utility functions for validating, previewing, converting, and compressing image files.",
  "frontend/src/utils/roleLabels.ts": "Provides user role display labels and helpers for mapping backend roles to readable text.",
  "frontend/src/utils/time.ts": "Utility functions for converting backend bigint timestamps into formatted or relative dates and times.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store and retrieve values in sessionStorage, and persist URL params with optional cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, breakpoints, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "JSON project state describing KPI-related features, removal of Teacher Attendance Check, and pending feature requests for configurable daily activities."
}