{
  "backend/main.mo": "Defines user profiles, daily reports, submissions, and new check-in/check-out types with access-controlled CRUD functions and in-memory maps.",
  "backend/migration.mo": "Adds empty check-in and check-out maps to the old actor state during migration.",
  "feature_evidence.json": "Lists feature evidence mapping features to affected files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Provides short descriptions of all frontend files and their roles in routing, UI, hooks, KPI logic, and submissions.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme color variables and global layout rules.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, profile setup, and routes for check-in, daily activities, check-out, and monitoring.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a sign‑out action when authorization fails.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Initial profile setup form allowing users to save their name and dedication.",
  "frontend/src/components/auth/RoleGate.tsx": "Authorization wrapper that shows children only if caller role matches allowed roles.",
  "frontend/src/components/kpi/KPIScoreBadge.tsx": "Displays a KPI score card with total and per‑category breakdown, applying color coding based on score levels.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with header, navigation, and role‑based menu options, handling sign‑out and routing.",
  "frontend/src/components/monitoring/KPITable.tsx": "Renders a KPI table for submissions with principal names, category scores, totals, and loading states.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, providing identity loading, login, logout, and status handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on profiles, submissions, check‑ins, and check‑outs using the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/kpi.ts": "Defines KPI activities and computes total and per‑activity KPI scores based on completed tasks.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, then renders App into the root element.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login interface using Internet Identity with descriptive UI and a sign‑in button.",
  "frontend/src/pages/MonitoringDashboardPage.tsx": "Displays performance metrics, submissions, check-ins, and check-outs with filtering and statistical summaries.",
  "frontend/src/pages/PrincipalCheckInPage.tsx": "Allows principals to submit check-ins with optional notes and view recent check-in history.",
  "frontend/src/pages/PrincipalCheckOutPage.tsx": "Allows principals to submit check-outs with optional notes and view recent check-out history.",
  "frontend/src/pages/PrincipalDailyFormPage.tsx": "Renders a daily activity submission form that computes KPI previews and posts structured activity reports.",
  "frontend/src/utils/time.ts": "Provides helpers to convert bigint timestamps to Date and format them as date, time, datetime, or relative time strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them as needed.",
  "frontend/tailwind.config.js": "Defines Tailwind theme, colors, typography, animations, and plugin configuration for the frontend.",
  "project_state.json": "Describes the project’s current state, features, requirements, and architectural notes for the SHQ Principal Daily Performance Tracker app."
}