{
  "kind": "build_request",
  "title": "Add separate Check-in and Check-out submissions with server timestamps; rename QPC to Qur’anic Parenting Center",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add a new Check-in submission feature that is stored separately from the existing Daily Activity submission, where the timestamp is generated on the backend (server time) at the moment of submission.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Tambahan terpisah. Timestamp server.",
          "Buat 3 fitur, fitur 1 absen masuk lalu submit, fitur 2 daily activity lalu submit, dan fitur 3 absen keluar lalu submit. Waktu dibuat automatis"
        ]
      },
      "acceptanceCriteria": [
        "Principal users can submit a Check-in event via a dedicated UI action (separate from Daily Activity submission).",
        "The backend stores the Check-in timestamp using server time (Time.now()), not a client-provided timestamp.",
        "Principals can fetch and view their own Check-in submissions history (at minimum: most recent Check-in time; optionally a list).",
        "Director/Management users can fetch Check-in submissions across principals (at minimum: included in admin queries; optionally displayed in the monitoring UI).",
        "Unauthorized callers (non-Principal for submit; non-Admin for cross-principal reads) are rejected consistently with existing access control patterns."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add a new Check-out submission feature that is stored separately from the existing Daily Activity submission, where the timestamp is generated on the backend (server time) at the moment of submission.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Tambahan terpisah. Timestamp server.",
          "fitur 3 absen keluar lalu submit"
        ]
      },
      "acceptanceCriteria": [
        "Principal users can submit a Check-out event via a dedicated UI action (separate from Daily Activity submission).",
        "The backend stores the Check-out timestamp using server time (Time.now()), not a client-provided timestamp.",
        "Principals can fetch and view their own Check-out submissions history (at minimum: most recent Check-out time; optionally a list).",
        "Director/Management users can fetch Check-out submissions across principals (at minimum: included in admin queries; optionally displayed in the monitoring UI).",
        "Unauthorized callers (non-Principal for submit; non-Admin for cross-principal reads) are rejected consistently with existing access control patterns."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Ensure the existing Daily Activity submission uses a backend-generated server timestamp, and update the QPC activity label to “Qur’anic Parenting Center” (no KPI/scoring logic changes).",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Timestamp server. Sama, tapi QPC tolong direvisi (Qur’anic Parenting Center)"
        ]
      },
      "acceptanceCriteria": [
        "When a Daily Activity submission is created, the stored timestamp reflects server time at submission (backend Time.now()), regardless of any client-provided value.",
        "The KPI scoring remains equal-weighted across 6 activities totaling 100 points/day, unchanged from current behavior.",
        "All user-facing labels that currently show “QPC” are updated to “Qur’anic Parenting Center” (including the activity checklist and KPI breakdown displays where applicable).",
        "No existing monitoring calculations break due to the label change (i.e., the underlying activity key remains compatible with current computations)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add navigation and routes so Principals can access three separate submission actions/pages: Check-in, Daily Activities, and Check-out, each with its own submit flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Jadi 3 kali submit",
          "Tambahan terpisah."
        ]
      },
      "acceptanceCriteria": [
        "The app provides clear navigation for Principal users to reach: Check-in form/action, Daily Activity form, and Check-out form/action.",
        "Each of the three flows has its own submit button and success/error feedback.",
        "Existing role-gating remains intact: Principal can access the submission routes; Director/Management cannot access Principal-only submit routes."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo; only introduce backend/migration.mo if an actual state migration is required by the implementation.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths (compose existing UI components instead).",
    "Use English for all user-facing text in the UI changes introduced by this request."
  ],
  "nonGoals": [
    "Do not change KPI weighting, the number of activities (6), or the 100-points-per-day total KPI model.",
    "Do not introduce any third-party authentication beyond Internet Identity.",
    "Do not add narrative report fields to monitoring (keep monitoring metrics-focused as currently designed)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}