{
  "kind": "build_request",
  "title": "Make KPI Daily Activities configurable to 5 items and remove Teacher Attendance Check (Admin & Director can edit)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the \"Teacher Attendance Check\" daily activity from the KPI Daily Activities feature so that only 5 daily activities are shown across the app (Daily Activity Form, KPI preview/badges, Monitoring KPI table, and KPI weights card).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-6",
          "recent-messages-8",
          "recent-messages-10"
        ],
        "quotes": [
          "Teacher attendence Check dihapus saja",
          "Buat daily activity-nya bisa diedit, bagi jadi 5 saja",
          "Ada di fitur daily actifity KPI. ... Batasi jadi 5 saja."
        ]
      },
      "acceptanceCriteria": [
        "The Daily Activity Form (/daily-activities) no longer renders an activity named \"Teacher Attendance Check\" and shows exactly 5 activity tiles/checkboxes.",
        "The Monitoring KPI table no longer renders a column named \"Teacher Attendance Check\" and shows exactly 5 activity columns.",
        "The KPI weights card (view-only for KepSek, editable for authorized roles) shows exactly 5 activity weight rows.",
        "No remaining user-facing text mentions \"Teacher Attendance Check\" anywhere in the UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Daily Activity submission flow so it remains compatible with the existing backend submission type while the removed activity is no longer user-editable: ensure any removed-activity fields are always submitted as a neutral/disabled value (e.g., rating 0 and a safe string) and do not affect KPI previews.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-8",
          "recent-messages-10"
        ],
        "quotes": [
          "Buat daily activity-nya bisa diedit, bagi jadi 5 saja",
          "Ada di fitur daily actifity KPI. ... Batasi jadi 5 saja."
        ]
      },
      "acceptanceCriteria": [
        "Submitting a Daily Activity report still succeeds without requiring the removed activity, and the computed KPI preview matches the 5 visible activities only.",
        "After submission, the UI resets only the 5 visible activities (no hidden/removed activity state remains)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Allow both Admin and Director roles to edit KPI Daily Activity configuration (the 5 visible daily activity KPI items/weights), including add/edit capability within the supported configuration model, and ensure non-Admin/Director users remain view-only.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-10"
        ],
        "quotes": [
          "admin dan direktur bisa menambah dan mengedit"
        ]
      },
      "acceptanceCriteria": [
        "Users who are Admin or Director can access an editable KPI configuration UI (inputs + save flow).",
        "Non-Admin/Director users can view the KPI configuration but cannot enter edit mode or save changes.",
        "Unauthorized backend calls to update KPI configuration return an authorization error that is surfaced in the UI as an English error message."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enforce the 5-item limit at the KPI configuration level by treating the removed activity's weight as non-editable and effectively disabled: the system must ensure the removed activity contributes 0 points and the remaining 5 activity weights must total 100.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-10"
        ],
        "quotes": [
          "Batasi jadi 5 saja."
        ]
      },
      "acceptanceCriteria": [
        "The KPI weights editor validates totals using only the 5 visible activities (must equal 100 with a small tolerance) and does not block saves due to the hidden/removed weight field.",
        "On save, the backend persists configuration such that the removed activity's weight is forced to 0 (even if a client attempts to set it non-zero).",
        "KPI preview/badges/table calculations do not show or include the removed activity as a separate line item, and its contribution is always 0."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if state shape must change.",
    "Do not edit files under frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text added or modified by this change."
  ],
  "nonGoals": [
    "Do not introduce new external databases, third-party auth providers, or real-time communication.",
    "Do not redesign the entire KPI system to support arbitrary dynamic activity schemas beyond the app’s current fixed submission structure.",
    "Do not change historical submissions data beyond ensuring the removed activity is not displayed and contributes 0 going forward."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}