{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "KPI Daily Activities: limit to 5 items, remove Teacher Attendance Check, and enable Admin+Director configuration edits",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the \"Teacher Attendance Check\" activity and ensure exactly 5 KPI daily activities render consistently across the Daily Activity Form, KPI preview/badges, Monitoring KPI table, and KPI weights card.",
      "acceptanceCriteria": [
        "The Daily Activity Form (/daily-activities) no longer renders an activity named \"Teacher Attendance Check\" and shows exactly 5 activity tiles/checkboxes.",
        "The Monitoring KPI table no longer renders a column named \"Teacher Attendance Check\" and shows exactly 5 activity columns.",
        "The KPI weights card (view-only for KepSek, editable for authorized roles) shows exactly 5 activity weight rows.",
        "No remaining user-facing text mentions \"Teacher Attendance Check\" anywhere in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/kpi.ts",
          "operation": "modify",
          "description": "Remove the hardcoded \"Teacher Attendance Check\" activity and refactor KPI activity metadata/utilities to operate on exactly 5 visible activities (aligned with the existing KPIConfig model), ensuring all helpers only expose these 5 items to the UI."
        },
        {
          "path": "frontend/src/pages/PrincipalDailyFormPage.tsx",
          "operation": "modify",
          "description": "Update the Daily Activity Form UI to render exactly 5 activity options sourced from the updated KPI activity metadata/utilities, and ensure no UI copy mentions the removed activity."
        },
        {
          "path": "frontend/src/components/kpi/DailyActivityWeightsCard.tsx",
          "operation": "modify",
          "description": "Update the KPI weights card to display exactly 5 activity rows (no removed activity row) and keep all user-facing text in English."
        },
        {
          "path": "frontend/src/components/kpi/KPIScoreBadge.tsx",
          "operation": "modify",
          "description": "Update KPI preview/badge rendering so the breakdown reflects exactly 5 visible activities and cannot display the removed activity."
        },
        {
          "path": "frontend/src/components/monitoring/KPITable.tsx",
          "operation": "modify",
          "description": "Update the Monitoring KPI table to render exactly 5 activity columns and remove any reference/labeling for the removed activity."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep Daily Activity submissions compatible with the existing backend submission type by always submitting the removed activity fields as neutral/disabled values and excluding them from KPI previews and UI state resets.",
      "acceptanceCriteria": [
        "Submitting a Daily Activity report still succeeds without requiring the removed activity, and the computed KPI preview matches the 5 visible activities only.",
        "After submission, the UI resets only the 5 visible activities (no hidden/removed activity state remains)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PrincipalDailyFormPage.tsx",
          "operation": "modify",
          "description": "Adjust the submission payload construction to always submit the removed activity’s backend fields as neutral/disabled values (e.g., rating 0 and a safe string) while mapping only the 5 visible activities from UI state into the remaining fields; ensure post-submit reset clears only the 5 visible activity states."
        },
        {
          "path": "frontend/src/lib/kpi.ts",
          "operation": "modify",
          "description": "Update KPI preview computation to sum only the 5 visible activities so removed/neutral fields never affect the computed KPI preview."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Allow Admin and Director users to edit KPI Daily Activity configuration (5 items/weights) with a save flow, while keeping non-Admin/Director users view-only and surfacing authorization errors in English.",
      "acceptanceCriteria": [
        "Users who are Admin or Director can access an editable KPI configuration UI (inputs + save flow).",
        "Non-Admin/Director users can view the KPI configuration but cannot enter edit mode or save changes.",
        "Unauthorized backend calls to update KPI configuration return an authorization error that is surfaced in the UI as an English error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MonitoringDashboardPage.tsx",
          "operation": "modify",
          "description": "Adjust role gating for the KPI configuration editor so both Admin and Director can edit (not only Director); continue to keep unauthorized users from seeing edit controls. Use the authorization component’s role-based access expectations for UI gating and error handling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/kpi/DailyActivityWeightsCard.tsx",
          "operation": "modify",
          "description": "Extend the weights card to support editing within the existing KPIConfig model for the 5 activities (e.g., editing names/weights/active flags if supported by the UI), including a save/cancel flow and English error messaging when save fails due to authorization. Verify the component's usage instructions before implementing (authorization-related UI expectations)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the KPI config update hook continues to convert authorization failures into a clear English error message for the UI to surface (and that the monitoring page uses that message). Verify the component's usage instructions before implementing (authorization-related error handling expectations)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Enforce the 5-item KPI configuration limit in the UI: validate totals using only the 5 visible activities (must total 100) and ensure all KPI previews/badges/tables exclude the removed activity and treat its contribution as 0.",
      "acceptanceCriteria": [
        "The KPI weights editor validates totals using only the 5 visible activities (must equal 100 with a small tolerance) and does not block saves due to the hidden/removed weight field.",
        "On save, the backend persists configuration such that the removed activity's weight is forced to 0 (even if a client attempts to set it non-zero).",
        "KPI preview/badges/table calculations do not show or include the removed activity as a separate line item, and its contribution is always 0."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/kpi/DailyActivityWeightsCard.tsx",
          "operation": "modify",
          "description": "Update validation logic to compute totals using only the 5 visible activity weights (with small tolerance to 100) and prevent any UI from editing/setting a removed activity weight; keep user-facing validation text in English."
        },
        {
          "path": "frontend/src/lib/kpi.ts",
          "operation": "modify",
          "description": "Ensure KPI preview and per-activity points helpers only operate on the 5 visible activities so the removed activity never appears and always contributes 0 in client-side calculations."
        },
        {
          "path": "frontend/src/components/monitoring/KPITable.tsx",
          "operation": "modify",
          "description": "Ensure monitoring KPI calculations and per-activity score rendering exclude the removed activity entirely (no column/line item) and totals reflect only the intended dimensions shown in the UI."
        },
        {
          "path": "frontend/src/components/kpi/KPIScoreBadge.tsx",
          "operation": "modify",
          "description": "Ensure KPI preview/badges breakdown rendering reflects exactly 5 activities and cannot display/include the removed activity as a separate line item."
        }
      ]
    }
  ]
}